tutorials/10.1.5.1D_2phase_4componentGas_YCO2i_0_compositionalGLSDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2_eql/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------